Repository: opentaproject/openta-public
Catalog: openta/django/backend/locale/*/LC_MESSAGES/django.po
Languages: ar, sv

source: User already exists, added you to the course.
ar: المستخدم موجود بالفعل ، تمت إضافتك إلى الدورة التدريبية.
sv: Användaren finns redan, lade dig till kursen.

source: Email domain must be
ar: يجب أن يكون مجال البريد الإلكتروني
sv: E-postdomänen måste vara

source: Registration password
ar: كلمة مرور التسجيل
sv: Registreringslösenord

source: Site is down for maintenance.
ar: الموقع تحت الصيانة.
sv: Webbplatsen är nere för underhåll.

source: account activation
ar: تفعيل الحساب
sv: kontoaktivering

source: EMAIL %s ALREADY EXISTS
ar: EMAIL %s EXISTS بالفعل

source: Password is now set, please login as %s.
ar: تم تعيين كلمة المرور الآن ، يرجى تسجيل الدخول كـ %s.

source: Database "%s" is not configured.
ar: لم يتم تكوين قاعدة البيانات &quot;%s&quot;.

source: 5 times per 30 seconds
ar: 5 مرات في 30 ثانية
sv: 5 gånger per 30 sekunder

source: Activation successful, please login.
ar: تم التفعيل بنجاح ، يرجى تسجيل الدخول.
sv: Aktivering lyckades, logga in.

source: User %s is already activated
ar: تم تنشيط المستخدم %s بالفعل

source: Activating user %s which does not exist
ar: تفعيل المستخدم %s وهو غير موجود

source: No courses yet
ar: لا توجد دورات بعد
sv: Inga kurser ännu

source: Not enrolled!
ar: لم يدرج اسمه!
sv: Ej inskriven!

source: Password reset link sent to your email (check your spam folder as well).
ar: تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني (راجع مجلد البريد العشوائي أيضًا).
sv: Lösenordsåterställningslänk skickad till din e-post (kolla även din skräppostmapp).

source: If you are not receiving an reset link by email, check your spam filter or junk mail. The email was sent from
ar: إذا كنت لا تتلقى رابط إعادة التعيين عن طريق البريد الإلكتروني ، فتحقق من عامل تصفية البريد العشوائي أو البريد غير الهام. تم إرسال البريد الإلكتروني من
sv: Om du inte får en återställningslänk via e-post, kolla ditt skräppostfilter eller skräppost. E-postmeddelandet skickades från

source: with the subject
ar: مع الموضوع
sv: med ämnet

source: times per hour.
ar: مرات في الساعة.
sv: gånger per timme.

source: Password reset successful, please login.
ar: إعادة تعيين كلمة المرور بنجاح ، يرجى تسجيل الدخول.
sv: Lösenordsåterställningen lyckades, logga in.

source: reveal LTI/Canvas parameters
ar: تكشف عن معلمات LTI / Canvas
sv: avslöja parametrar för LTI / Canvas

source: Check to enable the use of email
ar: تحقق لتمكين استخدام البريد الإلكتروني
sv: Markera för att aktivera användningen av e-post

source: Comma separated list of email domains that are permitted to self-register. Regex such as .* is accepted
ar: قائمة مفصولة بفواصل لمجالات البريد الإلكتروني المسموح لها بالتسجيل الذاتي. يتم قبول Regex مثل. *
sv: Kommaseparerad lista över e-postdomäner som får registrera sig själv. Regex som. * Accepteras

source: A short name without spaces , capitals or special characters; appears in course-url. Saving the course name enforces this. Do not plan to change this after students have begun using the course via canvas/lti.
ar: اسم قصير بدون مسافات أو أحرف كبيرة أو أحرف خاصة ؛ يظهر في عنوان url بالطبع. حفظ اسم الدورة يفرض هذا. لا تخطط لتغيير هذا بعد أن يبدأ الطلاب في استخدام الدورة التدريبية عبر canvas / lti.
sv: Ett kort namn utan mellanslag, versaler eller specialtecken; visas i kurs-url. Att spara kursnamnet styr detta. Planerar inte att ändra detta efter att studenterna har börjat använda kursen via canvas / lti.

source: A descriptive name appearing in on web pages. Can include blanks
ar: اسم وصفي يظهر في صفحات الويب. يمكن أن تشمل الفراغات
sv: Ett beskrivande namn som visas på webbsidor. Kan inkludera ämnen

source: Check to enable the autotranslation; needs google_auth_string
ar: تحقق لتمكين الترجمة التلقائية ؛ يحتاج google_auth_string
sv: Markera för att aktivera autotranslationen; behöver google_auth_string

source: Set up a password which can be used for self-registration
ar: قم بإعداد كلمة مرور يمكن استخدامها للتسجيل الذاتي
sv: Skapa ett lösenord som kan användas för självregistrering

source: Temporary message to appear on the login page and top of OpenTA pages
ar: تظهر رسالة مؤقتة على صفحة تسجيل الدخول وأعلى صفحات OpenTA
sv: Tillfälligt meddelande visas på inloggningssidan och överst på OpenTA-sidor

source: Allow self-registration with email from the listed domains
ar: السماح بالتسجيل الذاتي مع البريد الإلكتروني من المجالات المدرجة
sv: Tillåt självregistrering med e-post från de listade domänerna

source: Password for your email account (Please use SSO, the password is stored in cleartext on the server)
ar: كلمة المرور لحساب بريدك الإلكتروني (يرجى استخدام SSO ، يتم تخزين كلمة المرور في نص واضح على الخادم)
sv: Lösenord för ditt e-postkonto (använd SSO, lösenordet lagras i klartext på servern)

source: For instance smtp.chalmers.se Uses port 587/TLS
ar: على سبيل المثال smtp.chalmers.se يستخدم المنفذ 587 / TLS
sv: Till exempel smtp.chalmers.se Använder port 587 / TLS

source: For instance CID@chalmers.se
ar: على سبيل المثال CID@chalmers.se

source: Email of smtp account owner ,i.e. CID@chalmers.se
ar: البريد الإلكتروني لمالك حساب smtp ، مثل CID@chalmers.se
sv: E-post till ägaren av smtp-kontot, dvs. CID@chalmers.se

source: Allow anonymous student login
ar: السماح بتسجيل الدخول المجهول للطالب
sv: Tillåt anonym studentinloggning

source: Usually CID, but is net.chalmers.se\CID at chalmers
ar: عادةً ما يكون CID ، ولكنه net.chalmers.se \ CID في chalmers
sv: Vanligtvis CID, men är net.chalmers.se \ CID på chalmers

source: List of labels which can be displayed as option for each exercise.
ar: قائمة التسميات التي يمكن عرضها كخيار لكل تمرين.
sv: Lista över etiketter som kan visas som alternativ för varje övning.

source: Languages for translations in the course: the first language is dominant and used in emails.
ar: لغات الترجمة في الدورة: اللغة الأولى هي السائدة وتستخدم في رسائل البريد الإلكتروني.

source: Auto translation cannot be enabled with a blank Google auth string.
ar: لا يمكن تمكين الترجمة التلقائية بسلسلة مصادقة فارغة من Google.
sv: Automatisk översättning kan inte aktiveras med en tom Google-autentsträng.

source: Auto translation can only be enabled if Languages is nonempty.
ar: لا يمكن تمكين الترجمة الآلية إلا إذا كانت اللغات غير فارغة.
sv: Automatisk översättning kan endast aktiveras om språk inte är tillåtna.

source: Save
ar: يحفظ
sv: Spara

source: Added exercise
ar: تمرين إضافي
sv: Tillagd övning

source: Updated exercise
ar: تمرين محدث
sv: Uppdaterad övning

source: Checking status of file tree...
ar: جاري التحقق من حالة شجرة الملفات ...
sv: Kontrollerar filträdets status ...

source: Duplicate exercise keys!
ar: مفاتيح تمرين مكررة!
sv: Duplicera träningsknappar!

source: Exercise at [
ar: تمرن في [
sv: Uppgift vid [

source: ] has the same key as exercise in other course:
ar: ] له نفس مفتاح التمرين في دورة أخرى:
sv: ] har samma nyckel som övning i annan kurs:

source: ] has the same key as exercise at [
ar: ] له نفس مفتاح التمرين في [
sv: ] har samma nyckel som uppgivten vid [

source: The exercise with path
ar: التمرين مع المسار
sv: Övning i mapp

source: seems to have been moved to
ar: يبدو أنه قد تم نقله إلى
sv: verkar ha flyttats till

source: does no longer contain an exercise.xml file and will be deleted.
ar: لم يعد يحتوي على ملف Practice.xml وسيتم حذفه.
sv: innehåller inte längre en exercise.xml-fil och kommer att raderas.

source: changed exercise key, this will result in a new exercise being added and the old one deleted.
ar: تغيير مفتاح التمرين ، سيؤدي ذلك إلى إضافة تمرين جديد وحذف التمرين القديم.
sv: ändrad exerisekey, detta kommer att resultera i att en ny övning läggs till och den gamla tas bort.

source: Something will prevent a reload from being carried out, please review messages above.
ar: شيء ما سيمنع إعادة التحميل ، يرجى مراجعة الرسائل أعلاه.
sv: Något förhindrar att en omladdning genomförs, läs igenom meddelandena ovan.

source: Are you sure you want to do these actions?
ar: هل أنت متأكد أنك تريد القيام بهذه الإجراءات؟
sv: Är du säker på att du vill göra dessa åtgärder?

source: Do you want to do a reload? This will update all existing exercises and perform any additional actions listed above.
ar: هل تريد أن تفعل إعادة التحميل؟ سيؤدي هذا إلى تحديث جميع التمارين الحالية وتنفيذ أي إجراءات إضافية مذكورة أعلاه.
sv: Vill du ladda om? Detta kommer att uppdatera alla befintliga övningar och utföra eventuella ytterligare åtgärder som anges ovan.

source: Deleted
ar: تم الحذف
sv: raderade

source: since it is not present on disc anymore
ar: لأنه لم يعد موجودًا على القرص بعد الآن
sv: eftersom den inte finns på disken längre

source: Deleted an entry for
ar: تم حذف إدخال لـ
sv: Raderade en post för

source: since the stored exercise key did not correspond to the exercisekey in the folder.
ar: نظرًا لأن مفتاح التمرين المخزن لا يتوافق مع مفتاح التمرين في المجلد.
sv: eftersom den sparade träningsnyckeln inte motsvarade träningsvärdet i mappen.

source: Finished syncing exercises.
ar: تم الانتهاء من تمارين المزامنة.
sv: Färdiga med att synka uppgifter .

source: Answer rate exceeded, please wait before trying again. (Rate:
ar: تم تجاوز معدل الإجابة ، يرجى الانتظار قبل المحاولة مرة أخرى. (معدل:
sv: Svarsfrekvensen har överskridits. Vänta innan du försöker igen. (Frekvens:

source: Failed to evaluate expression.
ar: فشل في تقييم التعبير.
sv: Det gick inte att utvärdera uttrycket.

source: Unknown error, check your expression.
ar: خطأ غير معروف ، تحقق من تعبيرك.
sv: Okänt fel, kontrollera ditt uttryck.

source: Answer contains invalid character
ar: تحتوي الإجابة على حرف غير صالح
sv: Svaret innehåller ogiltigt tecken

source: ERROR IN AUTHOR EXPRESSION.
ar: خطأ في تعبير المؤلف.

source: Illegal matrix operation in %s
ar: عملية مصفوفة غير قانونية في %s

source: Error 533 Failed to evaluate expression. %s
ar: خطأ 533 فشل تقييم التعبير. %s

source: Seems like the expression does not have the correct units.
ar: يبدو أن التعبير لا يحتوي على الوحدات الصحيحة.
sv: Verkar som att uttrycket inte har rätt enheter.

source: The answer does not have the correct dimensions.
ar: الجواب ليس له الأبعاد الصحيحة.
sv: Svaret har inte rätt enheter.

source: Forbidden token:
ar: رمز ممنوع:
sv: Förbjudet token:

source: There seems to be a vector or matrix operation with incompatible dimensions.
ar: يبدو أن هناك عملية متجه أو مصفوفة ذات أبعاد غير متوافقة.
sv: Det verkar finnas en vektor- eller matrisoperation med oförenliga dimensioner.

source: Syntax error; only spaces give implicity multiply
ar: خطأ في بناء الجملة؛ الفراغات فقط هي التي تعطي الضمنية مضاعفة
sv: Syntaxfel; endast mellanslag ger implicitet multipliceras

source: are not valid variables.
ar: ليست متغيرات صالحة.
sv: är inte giltiga variabler.

source: There are more correct alternatives.
ar: هناك بدائل أكثر صحة.
sv: Det finns fler korrekta alternativ.

source: Terms do not seem to have the same unit.
ar: لا يبدو أن الشروط لها نفس الوحدة.
sv: Termer verkar inte ha konsekventa enheter.

source: Incorrect: variables missing:
ar: غير صحيح: المتغيرات مفقودة:
sv: Felaktigt: variabler saknas:

source: Failed to evaluate expression
ar: فشل في تقييم التعبير
sv: Det gick inte att utvärdera uttrycket

source: are not valid variables
ar: ليست متغيرات صالحة
sv: är inte giltiga variabler

source: Could not parse expression
ar: تعذر تحليل التعبير
sv: Det gick inte att tolka uttrycket

source: incorrect dimensions
ar: أبعاد غير صحيحة
sv: felaktiga dimensioner

source: (E) Forbidden token:
ar: (هـ) رمز ممنوع:
sv: (E) Förbjudet token:

source: (F) Forbidden token:
ar: (و) رمز ممنوع:
sv: (F) Förbjudet token:

source: (G) Forbidden token:
ar: (ز) رمز ممنوع:
sv: (G) Förbjudet token:

source: Unknown error2, check your expression.
ar: خطأ غير معروف 2 ، تحقق من تعبيرك.

source: Unknown error 1, check your expression.
ar: خطأ غير معروف 1 ، تحقق من التعبير الخاص بك.

source: Unknown error
ar: خطأ غير معروف
sv: Okänt fel

source: Incorrect units
ar: وحدات غير صحيحة
sv: Felaktiga enheter

source: Illegal pattern %s in %s
ar: نمط غير قانوني %s في %s

source: Unbalanced parenthesis
ar: أقواس غير متوازنة
sv: Obalanserad parentes

source: (A) Forbidden token:
ar: (أ) رمز ممنوع:
sv: (A) Förbjudet token:

source: answer in terms of an equality using ==
ar: الإجابة من حيث المساواة باستخدام ==
sv: svara i termer av likhet och använd ==

source: an equality is not permitted as answer
ar: لا يجوز المساواة كإجابة
sv: en likhet är inte tillåten som svar

source: forbidden function
ar: وظيفة ممنوعة
sv: förbjuden funktion

source: function is missing an argument
ar: وظيفة تفتقد إلى وسيطة
sv: funktion saknar ett argument

source: Error 213: Unidentified Error
ar: خطأ 213: خطأ غير معروف
sv: Fel 213: Oidentifierat fel

source: Error 182 incorrect dimensions
ar: خطأ 182 أبعاد غير صحيحة
sv: Fel 182 felaktiga dimensioner

source: Error 188 incorrect dimensions
ar: خطأ 188 أبعاد غير صحيحة
sv: Fel 188 felaktiga dimensioner

source: Permission denied
ar: طلب الاذن مرفوض
sv: Åtkomst nekad

source: Exercise not activated.
ar: التمرين غير مفعل.
sv: Träning inte aktiverad.

source: You are limited to
ar: أنت مقيد بـ
sv: Du är begränsad till

source: exercise check tries per minute.
ar: تحقق من التمرين يحاول في الدقيقة.
sv: försök per minut.

source: You cannot delete after the deadline has passed.
ar: لا يمكنك الحذف بعد انقضاء الموعد النهائي.
sv: Du kan inte ta bort efter att deadline har passerat.

source: Permission Denied
ar: طلب الاذن مرفوض
sv: Åtkomst nekad

source: Bye!
ar: وداعا!
sv: Hejdå!

source: Session terminated
ar: إنهاء الجلسة
sv: Sessionen avslutad

source: LTI authentication failed:
ar: فشلت مصادقة LTI:
sv: LTI-autentisering misslyckades:

source: Your username is usually your email
ar: عادة ما يكون اسم المستخدم الخاص بك هو بريدك الإلكتروني
sv: Ditt användarnamn är vanligtvis din e-postadress

source: Login failed
ar: فشل عملية الدخول
sv: Inloggningen misslyckades

source: Log in anonymously to
ar: تسجيل الدخول مجهول إلى
sv: Logga in anonymt till

source: Activation failed.
ar: فشل التفعيل.
sv: Aktivering misslyckad.

source: Random audit - Exercise
ar: تدقيق عشوائي - تمرين
sv: Slumpmässig granskning - Övning

source: Request failed .
ar: الطلب فشل .
sv: Begäran misslyckades.

source: CSRF authentication failed:
ar: فشل مصادقة CSRF:
sv: CSRF-autentisering misslyckades:

source: CSRF failure :
ar: فشل CSRF:
sv: CSRF-fel:

source: Send batch email
ar: إرسال بريد إلكتروني مجمّع
sv: Skicka batch-e-post

source: Home
ar: منزل، بيت

source: Exercises
ar: تمارين
sv: Övningar

source: Send email to users
ar: أرسل بريدًا إلكترونيًا إلى المستخدمين
sv: Skicka e-post till användare

source: Username
ar: اسم المستخدم
sv: Användarnamn

source: Info.
ar: معلومات.

source: You can only access this page
ar: يمكنك فقط الوصول إلى هذه الصفحة
sv: Du kan bara komma åt den här sidan

source: Valid domains:
ar: المجالات الصالحة:
sv: Giltiga domäner:

source: Send verification email
ar: ارسل ايميل التفعيل
sv: Skicka bekräftelsemail

source: Log in
ar: تسجيل الدخول
sv: Logga in

source: Proceed without registration
ar: أكمل بدون تسجيل
sv: Fortsätt utan registrering

source: Register by email
ar: التسجيل عن طريق البريد الإلكتروني
sv: Registrera dig via e-post

source: Lost password?
ar: كلمة مرور مفقودة؟
sv: Glömt lösenord?

source: Register
ar: يسجل
sv: Registrera

source: Problem?
ar: مشكلة؟

source: Privacy
ar: خصوصية
sv: Integritet

source: Set password
ar: ضبط كلمة السر
sv: Välj lösenord

source: This reset link is no longer valid.
ar: رابط إعادة التعيين هذا لم يعد صالحًا.
sv: Denna återställningslänk är inte längre giltig.

source: Send reset link
ar: أرسل رابط إعادة التعيين
sv: Skicka återställningslänk

source: To registration
ar: للتسجيل
sv: Till registrering

source: Save changes
sv: Spara ändringar

source: Cancel
sv: Avbryt
